package com.itheima.test5;

public class Test1 {
}
/*
1. 一个类与它的对象之间是什么关系？
    答: 类是抽象的,对象是具体的
        类是描述现实生活中的一类事物,对象是由类创建的一个实例

2. 如何定义一个类，由哪些部分组成，各个部分的作用是什么？
    答: 步骤: 1, 成员变量  该类事物的属性
              2, 成员方法  该类事物的行为

3. 如何创建一个对象，如何使用该对象？
    答: 1, 定义类
        2, 创建对象
        3, 使用对象
        对象名.成员变量
        对项目.成员方法

4. 局部变量和成员变量的区别？
    答: 1,在类中的位置不一样
        2,作用区域不一样
        3,初始化值的不同
        4,在内存中的位置不同
        5,生命周期不同

5. 请简述封装原则：
    答: 1.类要是公开的
        2.成员变量私有
        3.要有无参构造(必须的)
        4.要有有参构造(建议)
        5.提供get/set方法






 */