package com.itheima.test5;

public class Test1 {
    /*
    1. 什么叫做类与类的继承，作用是什么？
    答:  定义:
    Java中的继承是指在现有类的基础上定义一个新的类,现有类称为父类,新的类称为子类.
         作用:
                1, 提供代码的复用性;
                2, 让类与类质检产生了关系,为多态提供了前提.

    2. 请写出继承的格式
    答:  修饰符 class 子类名 extends 父类名 {
            代码
          }

    3. 请写出继承的特点
    答:  1.Java中的类只支持单继承.(一个类只有一个父类)
         2.一个类可以有多个子类
         3.可以多层继承(父类,子类,孙子,....)

    4. 请写出抽象方法的定义格式
    答:  修饰符 abstract 返回值类型 方法名(参数列表);

    5. 请写出抽象类的定义格式?并举例定义带有抽象方法的抽象类
    答:  定义格式:   abstract class 类名 {
                     }
             举例:   酒店内员工的工作,分工不同;

    6. 请写出抽象类的使用步骤
    答:   1, 定义类继承抽象类
          2, 重写抽象方法
          3, 创建子类对象
 */

}
